In [15]:
import pandas as pd

In [7]:
v = pd.Series([-1,1,200,191,4])
v

0     -1
1      1
2    200
3    191
4      4
dtype: int64

In [8]:
v<0

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [9]:
v*v == 1

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [10]:
v[v>100]

2    200
3    191
dtype: int64

In [11]:
v[v%2==0]

2    200
4      4
dtype: int64

In [12]:
v[(v>0)&(v<100)]

1    1
4    4
dtype: int64

In [17]:
x = pd.Series({"A":10, "B":100})
s1 = pd.Series({"A":2, "B":3})
s2 = pd.Series({"B":3, "A":2})
print(x,s1,s2)

A     10
B    100
dtype: int64 A    2
B    3
dtype: int64 B    3
A    2
dtype: int64

In [18]:
x*s1

A     20
B    300
dtype: int64

In [19]:
x*s2

A     20
B    300
dtype: int64

In [20]:
#x<s2   Value Error

In [21]:
x.lt(s2)

A    False
B    False
dtype: bool

In [22]:
x.gt(s2)

A    True
B    True
dtype: bool

In [25]:
x.eq(s2)
x.ge(s2)
x.le(s2)
x.ne(s2)

A    True
B    True
dtype: bool

In [26]:
s2.sort_index()

A    2
B    3
dtype: int64

In [32]:
col1 = pd.Series(["Alice","Bob","Cindy","Dan"])
col2 = pd.Series([6,7,8,9])
pd.DataFrame({
    "Names": col1,
    "Scores": col2
})

   Names  Scores
0  Alice       6
1    Bob       7
2  Cindy       8
3    Dan       9

In [33]:
pd.DataFrame({
    "Names": ["Alice","Bob","Cindy","Dan"],
    "Scores": [6,7,8,9]
})

   Names  Scores
0  Alice       6
1    Bob       7
2  Cindy       8
3    Dan       9

In [34]:
pd.DataFrame([
    ["Alice",6],
    ["Bob",7],
    ["Cindy",8],
    ["Dan",9]
])

       0  1
0  Alice  6
1    Bob  7
2  Cindy  8
3    Dan  9

In [35]:
pd.DataFrame({
    "Name":{"A":"Alice", "B":"Bob","C":"Cindy","D":"Dan"},
    "Score":{"A":6, "B":7,"C":8,"D":9}
})

    Name  Score
A  Alice      6
B    Bob      7
C  Cindy      8
D    Dan      9

In [37]:
pd.DataFrame([
    {"Name":"Alice","Score":6},
    {"Name":"Bob","Score":7},
    {"Name":"Cindy","Score":8},
    {"Name":"Dan","Score":9}
])

    Name  Score
0  Alice      6
1    Bob      7
2  Cindy      8
3    Dan      9

In [38]:
pd.DataFrame([
    {"Name":"Alice","Score":6},
    {"Name":"Bob","Score":7},
    {"Name":"Cindy","Score":8},
    {"Name":"Dan","Score":9}],
    index = ["A","B","C","D"]
)

    Name  Score
A  Alice      6
B    Bob      7
C  Cindy      8
D    Dan      9

In [39]:
col1 = pd.Series({"Alice":6,"Bob":7,"Cindy":8,"Dan":9})

In [40]:
col1.loc["Bob"]

7

In [43]:
col1.iloc[1]

7

In [44]:
col1["Cindy"]

8

In [47]:
df = pd.DataFrame([
    {"Name":"Alice","Score":6},
    {"Name":"Bob","Score":7},
    {"Name":"Cindy","Score":8},
    {"Name":"Dan","Score":9}],
    index = ["A","B","C","D"]
)
df

    Name  Score
A  Alice      6
B    Bob      7
C  Cindy      8
D    Dan      9

In [48]:
df.loc["A"]

Name     Alice
Score        6
Name: A, dtype: object

In [49]:
type(df.loc["A"])

pandas.core.series.Series

In [50]:
df.iloc[1]

Name     Bob
Score      7
Name: B, dtype: object

In [59]:
df["Name"]

A    Alice
B      Bob
C    Cindy
D      Dan
Name: Name, dtype: object

In [60]:
df["Score"].mean()

9.5

In [61]:
df.loc["B","Name"]

'Bob'

In [62]:
df.loc["B","Score"]

15

In [64]:
df.loc["B","Score"] +=3

In [65]:
df

    Name  Score
A  Alice      6
B    Bob     21
C  Cindy      8
D    Dan      9

In [67]:
df.iloc[-1,0]

'Dan'

In [69]:
df.iloc[1:3,:]

    Name  Score
B    Bob     21
C  Cindy      8

In [72]:
df.loc["B":"C","Score"] +=5

In [73]:
df

    Name  Score
A  Alice      6
B    Bob     26
C  Cindy     13
D    Dan      9

In [76]:
df.loc[["B","D"], "Score"] +=2

In [78]:
df

    Name  Score
A  Alice      6
B    Bob     28
C  Cindy     13
D    Dan     11

In [79]:
#Boolean Series
b = df["Score"]>=15

In [80]:
df[b]

  Name  Score
B  Bob     28

In [83]:
mov = pd.read_csv("IMDB-Movie-Data.csv")

In [84]:
mov.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

In [85]:
mov.tail()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [86]:
mov["Year"]

0      2014
1      2012
2      2016
3      2016
4      2016
       ...
993    2015
994    2007
995    2008
996    2014
997    2016
Name: Year, Length: 998, dtype: int64

In [87]:
mov.to_csv("movies2.csv")

In [88]:
mov.to_csv("movies3.csv", index=False)

In [100]:
#Highest rated movie with above average runtime
mean = mov["Runtime"].mean()
b = mov["Runtime"]>mean
long_movies = mov[b]
a = long_movies["Rating"].max()==long_movies["Rating"]
high = long_movies[a]
high

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
54,54,The Dark Knight,"Action,Crime,Drama",Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,533.32

In [102]:
stats = mov.describe()
stats

            Index         Year     Runtime      Rating
count  998.000000   998.000000  998.000000  998.000000
mean   498.500000  2012.779559  113.170341    6.723447
std    288.242086     3.207549   18.828877    0.945682
min      0.000000  2006.000000   66.000000    1.900000
25%    249.250000  2010.000000  100.000000    6.200000
50%    498.500000  2014.000000  111.000000    6.800000
75%    747.750000  2016.000000  123.000000    7.400000
max    997.000000  2016.000000  191.000000    9.000000

In [103]:
stats.loc["50%","Runtime"]

111.0